# Chinook

## 1. Create a pandas DataFrame

In [15]:
import mysql.connector as sql
import pandas as pd
# sql query
query="""SELECT customer.LastName, customer.FirstName, track.Name, album.Title FROM chinook.invoiceline as line 
join invoice on invoice.InvoiceId=line.InvoiceId 
join customer on invoice.CustomerId=customer.CustomerId 
join track on track.TrackId=line.TrackId 
join album on album.AlbumId=track.AlbumId 
order by customer.LastName, customer.FirstName;"""
# connection to database
db_connection = sql.connect(host='localhost', database='chinook', user='root', password='root')
# execute
df = pd.read_sql(query, con=db_connection)
df.head()

  LastName FirstName                   Name           Title
0  Almeida   Roberto          Amor De Muito  Afrociberdelia
1  Almeida   Roberto              Vai Valer    Acústico MTV
2  Almeida   Roberto  Um Satélite Na Cabeça  Afrociberdelia
3  Almeida   Roberto         Revolta Olodum          Olodum
4  Almeida   Roberto          Samba Do Lado  Afrociberdelia